test/fixtures/stripe/checkout-session-completed.json

{
  "id": "cs_test_a1N31jwL64dmiOkxYQryCc69EmaczRofyGcsTQgjJOaKLpmfLDm87x4cY1",
  "object": "checkout.session",
  "adaptive_pricing": {
    "enabled": true
  },
  "after_expiration": null,
  "allow_promotion_codes": null,
  "amount_subtotal": 3000,
  "amount_total": 3000,
  "automatic_tax": {
    "enabled": false,
    "liability": null,
    "provider": null,
    "status": null
  },
  "billing_address_collection": null,
  "branding_settings": {
    "background_color": "#ffffff",
    "border_style": "rounded",
    "button_color": "#6b5fe8",
    "display_name": "ITW Staging",
    "font_family": "default",
    "icon": {
      "file": "file_1PVKbpDEGraYraOkAsWXvanJ",
      "type": "file"
    },
    "logo": {
      "file": "file_1PVKbrDEGraYraOk3dgbXv6O",
      "type": "file"
    }
  },
  "cancel_url": "https://httpbin.org/post",
  "client_reference_id": null,
  "client_secret": null,
  "collected_information": null,
  "consent": null,
  "consent_collection": null,
  "created": 1771624428,
  "currency": "usd",
  "currency_conversion": null,
  "custom_fields": [],
  "custom_text": {
    "after_submit": null,
    "shipping_address": null,
    "submit": null,
    "terms_of_service_acceptance": null
  },
  "customer": null,
  "customer_account": null,
  "customer_creation": "if_required",
  "customer_details": {
    "address": {
      "city": "South San Francisco",
      "country": "US",
      "line1": "354 Oyster Point Blvd",
      "line2": null,
      "postal_code": "94080",
      "state": "CA"
    },
    "business_name": null,
    "email": "stripe@example.com",
    "individual_name": null,
    "name": "Jenny Rosen",
    "phone": null,
    "tax_exempt": "none",
    "tax_ids": []
  },
  "customer_email": null,
  "discounts": [],
  "expires_at": 1771710828,
  "invoice": null,
  "invoice_creation": {
    "enabled": false,
    "invoice_data": {
      "account_tax_ids": null,
      "custom_fields": null,
      "description": null,
      "footer": null,
      "issuer": null,
      "metadata": {},
      "rendering_options": null
    }
  },
  "livemode": false,
  "locale": null,
  "metadata": {},
  "mode": "payment",
  "origin_context": null,
  "payment_intent": "pi_3T31dxDEGraYraOk0Lm5iB2n",
  "payment_link": null,
  "payment_method_collection": "if_required",
  "payment_method_configuration_details": {
    "id": "pmc_1OmUeLDEGraYraOkK8MQcAeS",
    "parent": null
  },
  "payment_method_options": {
    "card": {
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card",
    "link",
    "cashapp"
  ],
  "payment_status": "paid",
  "permissions": null,
  "phone_number_collection": {
    "enabled": false
  },
  "recovered_from": null,
  "saved_payment_method_options": null,
  "setup_intent": null,
  "shipping_address_collection": null,
  "shipping_cost": null,
  "shipping_options": [],
  "status": "complete",
  "submit_type": null,
  "subscription": null,
  "success_url": "https://httpbin.org/post",
  "total_details": {
    "amount_discount": 0,
    "amount_shipping": 0,
    "amount_tax": 0
  },
  "ui_mode": "hosted",
  "url": null,
  "wallet_options": null
}