test/fixtures/stripe/invoice-payment-failed.json

{
  "id": "in_1T31IoDEGraYraOkwNNohtXq",
  "object": "invoice",
  "account_country": "US",
  "account_name": "ITW Staging",
  "account_tax_ids": null,
  "amount_due": 2000,
  "amount_overpaid": 0,
  "amount_paid": 0,
  "amount_remaining": 2000,
  "amount_shipping": 0,
  "application": null,
  "attempt_count": 1,
  "attempted": true,
  "auto_advance": false,
  "automatic_tax": {
    "disabled_reason": null,
    "enabled": false,
    "liability": null,
    "provider": null,
    "status": null
  },
  "automatically_finalizes_at": null,
  "billing_reason": "manual",
  "collection_method": "charge_automatically",
  "created": 1771623118,
  "currency": "usd",
  "custom_fields": null,
  "customer": "cus_U13Pt9XQOMdoQC",
  "customer_account": null,
  "customer_address": null,
  "customer_email": null,
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": "(created by Stripe CLI)",
  "discounts": [],
  "due_date": null,
  "effective_at": 1771623118,
  "ending_balance": 0,
  "footer": null,
  "from_invoice": null,
  "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1JFu2ZDEGraYraOk/test_YWNjdF8xSkZ1MlpERUdyYVlyYU9rLF9VMTNQYVlDRFlJcXlxbUtYZlBSSFNocno3d09LYTBGLDE2MjE2MzkyMg0200VZxEnWzY?s=ap",
  "invoice_pdf": "https://pay.stripe.com/invoice/acct_1JFu2ZDEGraYraOk/test_YWNjdF8xSkZ1MlpERUdyYVlyYU9rLF9VMTNQYVlDRFlJcXlxbUtYZlBSSFNocno3d09LYTBGLDE2MjE2MzkyMg0200VZxEnWzY/pdf?s=ap",
  "issuer": {
    "type": "self"
  },
  "last_finalization_error": null,
  "latest_revision": null,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "il_1T31InDEGraYraOkdxUQqzZX",
        "object": "line_item",
        "amount": 2000,
        "currency": "usd",
        "description": "(created by Stripe CLI)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "invoice": "in_1T31IoDEGraYraOkwNNohtXq",
        "livemode": false,
        "metadata": {},
        "parent": {
          "invoice_item_details": {
            "invoice_item": "ii_1T31InDEGraYraOk7AKHJH1R",
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "subscription": null
          },
          "subscription_item_details": null,
          "type": "invoice_item_details"
        },
        "period": {
          "end": 1771623117,
          "start": 1771623117
        },
        "pretax_credit_amounts": [],
        "pricing": {
          "price_details": {
            "price": "price_1T31InDEGraYraOkyU7YKWOU",
            "product": "prod_U13P3zGuNnCD1p"
          },
          "type": "price_details",
          "unit_amount_decimal": "2000"
        },
        "quantity": 1,
        "subtotal": 2000,
        "taxes": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/in_1T31IoDEGraYraOkwNNohtXq/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "number": "VKHSKUV5-0001",
  "on_behalf_of": null,
  "parent": null,
  "payment_settings": {
    "default_mandate": null,
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1771623118,
  "period_start": 1771623118,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": null,
  "rendering": {
    "amount_tax_display": null,
    "pdf": {
      "page_size": "letter"
    },
    "template": null,
    "template_version": null
  },
  "shipping_cost": null,
  "shipping_details": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "open",
  "status_transitions": {
    "finalized_at": 1771623118,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subtotal": 2000,
  "subtotal_excluding_tax": 2000,
  "test_clock": null,
  "total": 2000,
  "total_discount_amounts": [],
  "total_excluding_tax": 2000,
  "total_pretax_credit_amounts": [],
  "total_taxes": [],
  "webhooks_delivered_at": null
}